a = open('holizm.html','w')
meow = """<!DOCTYPE html>
<html>
<head>
<title>Холизм</title>
</head>
<body>
<body bgcolor="#ffc847">
<h1 align="left"><i>Холизм</i></h1>
<HR>
<img src="https://data.whicdn.com/images/274993746/original.gif" align="right" width="50%" height="50%" hspace="0" vspace="30" >
<h2><tt> Холизм — в широком смысле — позиция в философии и науке по проблеме соотношения 
части и целого, исходящая из качественного своеобразия и приоритета 
целого по отношению к его частям.
В узком смысле под холизмом понимают «<cite>философию целостности</cite>», разработанную южноафриканским 
философом и политическим деятелем Я. Смэтсом, который ввёл в философскую речь термин 
«<cite>холизм</cite>» в 1926 году, опираясь на слова из «<cite>Метафизики</cite>» Аристотеля «<cite>целое больше, чем сумма его частей</cite>».

<p>Принцип холизма гласит: <cite>целое всегда есть нечто большее, чем простая сумма
его частей.</cite> С холистической позиции, весь мир — это единое целое, а выделяемые 
нами отдельные явления и объекты имеют смысл только как часть общности. 
В связи с этим многими холистическими мыслителями религиозной и трансцендентальной ориентации 
делался вывод, что развитие мира должна направлять некая внешняя по отношению к нему сила, хотя, 
например, такой выраженный имманентист, как Г. Гегель, тоже был последовательным холистом.

<p>Холизм господствовал в европейской философской мысли с древности до XVII столетия. 
Пример холистического утверждения из трудов Гиппократа: «<cite>человек есть универсальная и единая часть от окружающего мира</cite>», или же «<cite>микрокосм в макрокосме</cite>». 
Представитель классического немецкого идеализма Г. В. Ф. Гегель говорил: «<cite>только целое имеет смысл</cite>».

Однако с развитием в XVII—XIX веках науки и распространением в философии и естествознании 
механистических и редукционистских идей возобладал взгляд на любую систему как на производное частей, 
и окрепло убеждение, что свойства любого объекта могут быть выведены из анализа его составляющих элементов. 
Соответственно, холистический принцип стал восприниматься как не имеющая практической ценности философская концепция 
и оказался оттеснённым на периферию общественного сознания.

Интерес к идеям холизма снова возрос в XX веке в связи с кризисом классической 
картины мира и расцветом герменевтики. 
Собственно, в это время и появился термин — в «<cite>философии целостности</cite>» Я. Смэтса.</tt></h2>
</body>
</html>"""
a.write(meow)
a.close()